Repository: TheAshenWitch/Szakdoga_EVC0WO
Catalog: Szakdoga/Resources/Strings.*.resx
Languages: hu

# AddButton
source: Add
hu: Hozzáad

# ClearAllButton
source: Clear all
hu: Lista törlése

# CountLabel
source: Count
hu: Darab

# DeleteButton
source: Delete
hu: Törlés

# ExportButton
source: Export
hu: Exportálás

# HeightLabel
source: Height
hu: Magasság

# NameLabel
source: Name
hu: Név

# OptimiseButton
source: Optimise
hu: Optimalizálás

# RadioCrossDir
source: Cross direction
hu: Keresztirány

# RadioGrainDir
source: Grain direction
hu: Szálirány

# RadioGuillotineOpt
source: Guillotine
hu: Egyenes

# RadioHeuristicOpt
source: Heusristic
hu: Heurisztikus

# RadioVariableDir
source: Variable direction
hu: Variálható irány

# SaveButton
source: Save
hu: Mentés

# SettingsButton
source: Settings
hu: Beállítások

# StatisticsLabel
source: Statistics
hu: Statisztika

# UpdateButton
source: Update
hu: Firssítés

# WidthLabel
source: Width
hu: Szélesség

# NoOfSheetsLabel
source: Number of sheets
hu: Lapok darabszáma

# NoOfPiecesLabel
source: Number of pieces
hu: Elemek darabszáma

# TotalAreaOfPiecesLabel
source: Total area of pieces
hu: Darabok összterülete

# TotalWasteAreaLabel
source: Total waste area
hu: Összes hulladék

# MaterialUtilizationLabel
source: Material utilization
hu: Anyag kihasználás

# TotalCutLengthLabel
source: Total cut length
hu: Vágás hossz

# EdgeSealingNeededLabel
source: Edge sealing needed
hu: Szükséges élzáró

# TotalSheetCostLabel
source: Total sheet cost
hu: Lapok ára

# TotalEdgeSealingCostLabel
source: Edge sealing cost
hu: Élzáró ár

# TotalCostLabel
source: Total cost
hu: Össz ár

# MaterialUtilThisSheetLabel
source: Material utilization this sheet
hu: Anyag kihasználás ezen lapon

# PiecesThisSheetLabel
source: Pieces this sheet
hu: Darabok száma ezen a lapon

# WasteAreaThisSheetLabel
source: Waste area this sheet
hu: Hulladék ezen a lapon

# SettingsWidthLabel
source: Width
hu: Szélesség

# SettingsHeightLabel
source: Height
hu: Magasság

# SettingsBladeThicknessLabel
source: Blade thickness
hu: Fűrész vastagság

# SettingsSheetPaddingLabel
source: Sheet padding
hu: Lap ráhagyás

# SettingsSheetCostLabel
source: Sheet cost
hu: Lap ár

# SettingsEdgeSealingCostLabel
source: Edge sealing cost
hu: Élzáró ár/m

# SettingsSheetColor
source: Sheet color
hu: Lap szín

# SettingsSheetManufacturerLabel
source: Sheet manufacturer
hu: Lap gyártó

# LoadButton
source: Load
hu: Betöltés

# Title
source: CutOptimizer
hu: Vágás Optimalizáló

# SettingsLanguageLabel
source: Language
hu: Nyelv

# ApplyButton
source: Apply
hu: Alkalmaz

# SavePromptText
source: Save pieces list
hu: Darablista mentése

# SaveSuccessText
source: Pieces saved successfully.
hu: Darablista mentése sikeres.

# SaveErrorText
source: Error saving pieces
hu: Hiba a darablista mentése közben

source: Success
hu: SIkeres

source: Error
hu: Hiba

# LoadPromptText
source: Load pieces list
hu: Darablista betöltése

# LoadErrorText
source: Error during loading
hu: Hiba a betöltés során

# AddHeightWidthPrompt
source: Please enter both height and width.
hu: Kérem szélességet és magasságot is adjon meg.

source: Warning
hu: Figyelmeztetés

# InvalidNumberWidth
source: Invalid width format. Please enter a valid number.
hu: Hibás szélesség formátum, kérem számot adjon meg.

# InvalidNumberHeight
source: Invalid height format. Please enter a valid number.
hu: Hibás magasság formátum, kérem számot adjon meg.

# InvalidNumberCount
source: Invalid count format. Please enter a valid number.
hu: Hibás darabszám formátum, kérem számot adjon meg.

# ConfirmClearText
source: Are you sure you want to clear all pieces?
hu: Biztosan törölni szeretné a listát?

source: Confirm
hu: Megerősítés

# SamePiecePromt
source: A piece with the same dimensions and cut direction already exists. Continue?
hu: Egy darab megegyező névvel és méretekkel már létezik. Szeretné folytatni?

# DimensionErrorText
source: Height and width must be greater than zero.
hu: A magasságnak és a szélességnek nagyobbnak kell lennie, mint nulla.

# EmptyListError
source: No pieces to optimize.
hu: Nincsenek optimalizálandó darabok.
